{
  "summary": [
    {
      "summary": "A group of researchers presented their findings on security flaws in 5G basebands at the Black Hat cybersecurity conference. The vulnerabilities, found in basebands made by Samsung, MediaTek, and Qualcomm, could have allowed hackers to spy on victims and launch attacks. Using a custom-made analysis tool called 5GBaseChecker, the researchers discovered vulnerabilities in phones made by Google, OPPO, OnePlus, Motorola, and Samsung. The vulnerabilities could trick phones into connecting to a fake base station, allowing hackers to launch attacks. The researchers also downgraded victims from 5G to older protocols, making it easier to eavesdrop on communications. Most vendors have fixed the vulnerabilities, except MediaTek and Qualcomm who did not comment.",
      "summaryeli15": "Researchers from Pennsylvania State University identified security flaws in 5G basebands, the processors used by cell phones to connect to mobile networks. The vulnerabilities, found in basebands made by Samsung, Qualcomm, and MediaTek, could have allowed hackers to hack and spy on victims by tricking their phones into connecting to fake cell phone towers. Most vendors have fixed the vulnerabilities, and the researchers released their analysis tool on GitHub for other researchers to use.",
      "title": "5G Base Station Exploit",
      "link": "https://techcrunch.com/2024/08/07/hackers-could-spy-on-cellphone-users-by-abusing-5g-baseband-flaws-researchers-say/"
    },
    {
      "summary": "Computer chips manufactured by AMD are vulnerable to a complex hardware-level exploit known as Sinkclose, which allows hackers with deep kernel-level access to a system to plant persistent malware that is difficult to detect and remove. The only way to completely remove the malware is by physically opening the computer's case and manually scouring the memory using a hardware tool. In practical terms, affected users may need to discard their computers. Patches for Sinkclose are expected to be integrated into future updates for Windows machines, while patches for servers, embedded systems, and Linux machines may be more manual and dependent on the specific distribution of Linux. It is important to implement any available fixes as soon as possible, as Sinkclose compromises the entire system's security if exploited.",
      "summaryeli15": "Researchers have discovered a new type of malware called Sinkhole, which is extremely difficult to detect and remove from a computer. The only way to completely get rid of it is by physically connecting to the computer's memory chips and manually removing the malware. This process is so complex that it is almost impossible to do effectively, so the best solution may be to replace the entire computer. The vulnerability can only be exploited if the hacker already has access to the computer's core operating system. Fixes for Sinkhole are expected to be integrated into future updates for Windows machines.",
      "title": "AMD Sinkclose Flaw",
      "link": "https://www.wired.com/story/amd-chip-sinkclose-flaw/"
    },
    {
      "summary": "In this release, there is integration with the new Mempool Accelerator™ service, which helps confirm Bitcoin transactions that are stuck. You can now submit acceleration requests directly to mempool.space from your own self-hosted instance of The Mempool Open Source Project®. By self-hosting, you have more control over your transactions, but if they get stuck, Mempool Accelerator™ can help fix the issue. However, Mempool 3.x no longer supports blockstream/electrs. For low-powered home server hardware, you can still use romanz/electrs. But for production installations, you need to migrate to mempool/electrs, which offers bug fixes, improvements, and new APIs. When migrating, a full wipe and re-index of your electrs db is necessary.",
      "summaryeli15": "We listen to your feedback and take it seriously. This update helps speed up stuck Bitcoin transactions. You can now use our new service to make your transactions go through faster. Be your own explorer and host your own mempool. But if your transaction gets stuck, our Mempool Accelerator™ service can fix it. Also, there are changes for people with low-power home servers, but it's a bit technical.",
      "title": "v3.0.0",
      "link": "https://github.com/mempool/mempool/releases/tag/v3.0.0"
    },
    {
      "summary": "Dark Skippy is a method for a malicious signing device to leak secret keys, specifically discovered in the context of Bitcoin signing devices and hardware wallets. It involves using a modified signing function to covertly exfiltrate the master secret seed by embedding it within transaction signatures. Dark Skippy requires corrupting the signing device with malicious firmware and has not been observed in the wild yet. The attack can be enhanced by blinding the nonce and watermarking affected transactions. An attacker can then extract the seed, wait for the funds, and it is difficult to detect or determine what happened. Dark Skippy is considered the best-in-class attack for malicious signing devices, although the attack vector itself is not new. There are mitigations available, including anti-exfil signing protocols, and new ideas for mitigations are being explored. A worked example and demonstration video are provided for reference. Contact information is available for inquiries, comments, and press.",
      "summaryeli15": "Dark Skippy is a sneaky way for someone to steal secret keys that are used to sign transactions. They do this by changing the way the signing process works, and then they can secretly get the keys they need. This attack was found in Bitcoin hardware wallets, but it could be used in other places too. The attacker needs to trick the signing device with bad software, and then they can find the secret keys by solving a puzzle. This attack hasn't been seen in real life yet.",
      "title": "Demo",
      "link": "https://darkskippy.com/"
    },
    {
      "summary": "- Multiple vulnerabilities were identified in Bitcoin Core versions, and fixes were released on specific dates.\n- Some vulnerabilities allowed nodes to be spammed or crashed, but fixes were implemented.\n- Other vulnerabilities caused CPU and memory issues or allowed potential attacks on the network.\n- Bitcoin Core released various versions with bug fixes, improvements, and new features.\n- Some releases focused on security fixes, while others addressed performance and usability issues.\n- Segregated Witness (segwit) was introduced, offering benefits such as increased capacity and improved security.\n- Bitcoin Core development involved extensive testing and collaboration among contributors.\n- The roadmap for scalability and technical consensus was shared to address Bitcoin's growth challenges.",
      "summaryeli15": "Nodes are important computers that help run the Bitcoin network. Sometimes, people find ways to attack and crash these nodes. However, the developers of Bitcoin Core release updates to fix these problems and make the Bitcoin network more secure. These updates are like patches that solve the issues and prevent future attacks. So, it's important for users to regularly update their Bitcoin Core software to ensure a safe and smooth experience.",
      "title": "Bitcoin Core EoL Security Disclosures",
      "link": "https://bitcoincore.org/en/blog/"
    },
    {
      "summary": "This article emphasizes the importance of user feedback and the commitment to consider it seriously. The company values user input and strives to incorporate it into their decision-making process. They encourage users to share their thoughts and opinions to improve their services. The article also mentions that documentation is available to provide comprehensive information about the available qualifiers. Readers are directed to refer to the documentation for a better understanding.",
      "summaryeli15": "When you give us your thoughts and opinions, we listen and care about what you have to say. We read all of your feedback and consider it important. If you want to know more about the ways we evaluate and choose from all the options, you can look at our instructions.",
      "title": "1,2] Released",
      "link": "https://github.com/BlueWallet/BlueWallet/releases/tag/v7.0.2"
    },
    {
      "summary": "BIP47, or Reusable Payment Codes for Hierarchical Deterministic Wallets, allows for the creation of static payment codes to avoid address reuse in Bitcoin transactions. This has several use cases, such as donation addresses to maintain privacy and avoiding seizure of funds by governments. BIP47 also improves user experience by eliminating the need to request a new address for each transaction. The process involves using the payment code between the sender and receiver to generate new addresses and encrypting the payment code using XOR encryption. The article provides a step-by-step implementation example using the bcoin library. The code demonstrates how to derive payment addresses and encrypt payment codes for both the sender and receiver wallets.",
      "summaryeli15": "BIP47, or Reusable Payment Codes, is a way to create static payment codes for Bitcoin transactions. It allows people to generate new addresses every time they receive a payment, which improves privacy and avoids address reuse. This can be useful for donation addresses, avoiding government seizure, and improving user experience. The process involves creating a shared secret between the sender and receiver and encrypting the payment code. Wallets like Samourai and Sparrow have implemented BIP47.",
      "title": "BIP47 Address Support",
      "link": "https://medium.com/@ottosch/how-bip47-works-ee641cc14bf3"
    },
    {
      "summary": "- Feedback from users is taken seriously.\n- The Bisq 2 application has been renamed to Bisq2.\n- When installing Bisq2, manually delete the old Bisq 2 application to avoid database corruption.\n- To verify the Bisq installer, follow the instructions in the wiki.\n- Import the signing key from the given URL.\n- Use \"gpg --digest-algo SHA256 --verify BINARY{.asc*,}\" to verify signatures.\n- Verify the jar file using the given command.\n- Notarization has been removed from the build pipeline for macOS installations.\n- Follow the provided guide for macOS Ventura users.\n- Developer code signing has been removed for Windows installations.\n- There are known issues with Anti-Virus software causing problems with Bisq.\n- Consider using a non-Windows system when dealing with cryptocurrencies.\n- For Debian users, there is a specific instruction provided.\n- If encountering problems, report them in a Github issue.",
      "summaryeli15": "We take feedback seriously and want you to know that we're listening. If you want more information, check out our documentation. Also, we've renamed Bisq 2 to Bisq2 and you need to manually delete the old version when you install the new one. To make sure your installer is authentic, follow the instructions on our wiki. There are also instructions on how to verify the jar file. We've made some changes to the installation process for macOS, so follow the guide provided. If you encounter any issues, let us know. We're aware of some problems with antivirus software on Windows and recommend using a non-Windows system for cryptocurrency transactions. We also provide specific instructions for different operating systems.",
      "title": "Bisq 2.1.0 Released",
      "link": "https://github.com/bisq-network/bisq2/releases/tag/v2.1.0"
    },
    {
      "summary": "- Feedback is taken seriously.\n- Documentation contains all available qualifiers.\n- Release notes draft is open for contributions.\n- This release includes new features, bug fixes, performance improvements, and updated translations.\n- Bugs should be reported on GitHub.\n- Shut down old version before running installer for upgrade.\n- Testnet4 support added.\n- Switched off binding to 127.0.0.1:8334 for Tor connections.\n- UNIX domain sockets can be used for proxy connections.\n- New flags added to -whitelist for controlling permissions.\n- Data directory on Windows has been moved.\n- Pay To Anchor(P2A) introduced as a new standard witness output type.\n- Limited package RBF enabled.\n- JSON-RPC server responds strictly to JSON-RPC 2.0 requests.\n- Improved format for dumptxoutset and loadtxoutset RPCs.\n- Warnings field in getblockchaininfo, getmininginfo, and getnetworkinfo returns all active node warnings.\n- Updated error message for sendrawtransaction RPC.\n- Default mode for estimatesmartfee RPC changed to economical.\n- GCC 11.1+ or Clang 16.0+ required to compile Bitcoin Core.\n- Minimum required glibc is 2.31.\n- -enable-lcov-branch-coverage option removed.\n- Alerts can be raised multiple times with -alertnotify.\n- GUI and wallet-related settings have changed.\n- Thanks to contributors and translators.",
      "summaryeli15": "We listen to your feedback and take it very seriously. We have made some updates to our software, including new features, bug fixes, and improvements. If you find any issues, please report them to us on GitHub. If you are using an older version, make sure to shut it down before updating. We support different operating systems, but some may not work as well. We have added support for a new network called Testnet4. Some changes have been made to how the software connects to the internet. We have also made improvements to the user interface and wallet features. We want to say thank you to everyone who helped make this release possible.",
      "title": "Bitcoin Core 28.0 Release Notes",
      "link": "https://github.com/bitcoin-core/bitcoin-devwiki/wiki/28.0-Release-Notes-Draft"
    },
    {
      "summary": "If the difficulty adjustment is set at 2x or less, it can still be exploited. In this scenario, it would take approximately 2.83 windows' worth of time, but produce 333 windows' worth of blocks without raising the difficulty. \n\nTo clarify, the attacker has 100% of the hashrate. The total elapsed time would be around 4.41 weeks, three difficulty periods have passed, and the difficulty is back to the original. However, the timestamp has progressed to around 5.66 weeks, causing a problem with broadcasting the blocks. \n\nThis information is powered by Discourse and is best viewed with JavaScript enabled.",
      "summaryeli15": "If the limit for adjusting difficulty in a process is set to a small number (let's say 2 times), someone could exploit it by finishing the process faster than expected without increasing the difficulty. However, if the time taken is calculated using a more accurate equation, the time will still be ahead and the process cannot be completed.",
      "title": "A better timewarp attack",
      "link": "https://delvingbitcoin.org/t/zawy-s-alternating-timestamp-attack/1062/12"
    },
    {
      "summary": "Summary:\n\n- The FBI has reported that the RansomHub ransomware has breached 210 victims since February. The malware exploits a five-year-old zero-day vulnerability to infect outdated IP cameras.\n- Russian hacker group APT29 has been using iOS and Chrome exploits created by spyware vendors to carry out their attacks.\n- Fake Palo Alto GlobalProtect software is being used as a lure to backdoor enterprises.\n- A researcher is being sued for sharing stolen data with the media.\n- A course on ethical hacking is recommended for those aspiring to become bug bounty hunters.\n- The recent cyberattack on Halliburton has been linked to the RansomHub ransomware gang.\n- Almost 2.7 billion records of personal information for people in the United States have been leaked on a hacking forum. The data includes names, social security numbers, addresses, and possible aliases. The leak was allegedly conducted by a threat actor named SXUL.\n- National Public Data, a company that collects and sells personal data, has been hit by a data breach affecting 4.2 million people. The data includes social security numbers.\n- Users are advised to monitor their credit reports for fraudulent activity and to be vigilant against phishing attempts.",
      "summaryeli15": "A company called National Public Data collects personal information for background checks and sells it to other companies. Some hackers stole about 2.7 billion records from National Public Data and leaked them online. The stolen data includes names, social security numbers, and addresses. It's important for people in the US to monitor their credit reports and be careful of phishing attempts to protect themselves.",
      "title": "Hackers Leak 2.7 Billion Data Records (SSNs, Addresses)",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-leak-27-billion-data-records-with-social-security-numbers/"
    },
    {
      "summary": "Julian Assange has pleaded guilty to a single felony charge for publishing U.S. military secrets in a deal with the Justice Department that secures his freedom and concludes a long legal saga. He has been sentenced to time already served in Britain and will return home to Australia. His father expressed joy over his son's impending return. The plea deal was made in a U.S. district court in Saipan, the capital of the Northern Mariana Islands, allowing Assange to avoid entering the continental United States. The case has raised concerns about press freedom and national security. Assange's lawyers believe that this case sets a dangerous precedent that should concern journalists everywhere. Assange appeared upbeat and relaxed during the hearing, cracking jokes with the judge.",
      "summaryeli15": "Julian Assange, the founder of WikiLeaks, has pleaded guilty to releasing secret U.S. military information. As part of a deal with the U.S. Justice Department, he has been sentenced to time already served in Britain and will be set free. Assange's case has sparked debate over press freedom and national security.",
      "title": "Jullian Assange Ends Legal Fight",
      "link": "https://apnews.com/article/assange-justice-department-plea-wikileaks-saipan-australia-00eb380879ff636cc9b916f82f82ed40"
    }
  ]
}